{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "model_0_inputLayer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "model_0_inputLayer"}, "inbound_nodes": []}, {"name": "Conv2D_model_0_layer0_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer0_branch", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["model_0_inputLayer", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer0_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer0_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer0_branch", 0, 0, {}]]]}, {"name": "identity_2", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer0_branch", 0, 0, {}]], [["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["identity_2", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer1_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer1_branch", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer1_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer1_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer1_branch", 0, 0, {}]]]}, {"name": "identity_3", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer1_branch", 0, 0, {}]], [["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_3", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["identity_3", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer2_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer2_branch", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer2_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer2_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer2_branch", 0, 0, {}]]]}, {"name": "identity_4", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer2_branch", 0, 0, {}]], [["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_4", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["identity_4", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer3_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer3_branch", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer3_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer3_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer3_branch", 0, 0, {}]]]}, {"name": "identity_5", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer3_branch", 0, 0, {}]], [["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_5", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["identity_5", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer4_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer4_branch", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer4_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer4_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer4_branch", 0, 0, {}]]]}, {"name": "identity_6", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer4_branch", 0, 0, {}]], [["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_6", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["identity_6", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer5_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer5_branch0", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer5_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer5_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer5_branch0", 0, 0, {}]]]}, {"name": "identity_7", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer5_branch0", 0, 0, {}]], [["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_7", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["identity_7", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer6_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer6_branch0", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer6_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer6_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer6_branch0", 0, 0, {}]]]}, {"name": "identity_8", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer6_branch0", 0, 0, {}]], [["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_8", 0, 0, {}]]]}, {"name": "Conv2D_", "class_name": "Conv2D", "config": {"name": "Conv2D_", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["identity_8", 1, 0, {}]]]}, {"name": "BatchNorm_", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_", 0, 0, {}]]]}, {"name": "identity_9", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_", 0, 0, {}]], [["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_9", 0, 0, {}]]]}, {"name": "Conv2D_model_0_layer7_branch00", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer7_branch00", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["identity_9", 1, 0, {}]]]}, {"name": "BatchNorm_model_0_layer7_branch00", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer7_branch00", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer7_branch00", 0, 0, {}]]]}, {"name": "identity_10", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer7_branch00", 0, 0, {}]], [["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_10", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["identity_10", 1, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["identity_6", 1, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"name": "Conv2D_model_0_layer7_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer7_branch01", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["identity_9", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer8_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer8_branch1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer7_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer7_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer7_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer8_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer8_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer8_branch1", 0, 0, {}]]]}, {"name": "identity_13", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer7_branch01", 0, 0, {}]], [["leaky_re_lu_12", 0, 0, {}]]]}, {"name": "identity_11", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer8_branch1", 0, 0, {}]], [["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_13", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_11", 0, 0, {}]]]}, {"name": "Conv2D_model_0_layer8_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer8_branch01", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["identity_13", 1, 0, {}]]]}, {"name": "Conv2D_model_0_layer9_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_0_layer9_branch1", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["identity_11", 1, 0, {}]]]}, {"name": "BatchNorm_model_0_layer8_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer8_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer8_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_0_layer9_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_0_layer9_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_0_layer9_branch1", 0, 0, {}]]]}, {"name": "identity_14", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer8_branch01", 0, 0, {}]], [["leaky_re_lu_13", 0, 0, {}]]]}, {"name": "identity_12", "class_name": "Identity", "config": {"name": "Identity", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_0_layer9_branch1", 0, 0, {}]], [["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_13", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_14", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["identity_12", 0, 0, {}]]]}, {"name": "model_0_outputLayer_0", "class_name": "IdentityFinalLayer", "config": {"name": "IdentityFinalLayer", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["identity_14", 1, 0, {}]]]}, {"name": "model_0_outputLayer_1", "class_name": "IdentityFinalLayer", "config": {"name": "IdentityFinalLayer", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["identity_12", 1, 0, {}]]]}, {"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 13, 3, 85], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 26, 3, 85], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "yolo_loss_model_0", "class_name": "Lambda", "config": {"name": "yolo_loss_model_0", "trainable": true, "dtype": "float32", "function": ["4wUAAAAAAAAAGwAAAAsAAAADAAAAc3ADAAB0AHwBgwFkARoAfQV8AGQCfAWFAhkAiQZ8AHwFZAKF\nAhkAiQV8BWQBawJySGQDZARkBWcDZAFkBmQHZwNkCGQJZApnA2cDbhJkAWQGZAdnA2QJZApkAWcD\nZwJ9BnQBoAJ0AaADiAZkCBkAoQFkCWQBhQIZAGQLFAB0AaAEiAVkCBkAoQGhAn0HhwWHBmYCZAxk\nDYQIdAV8BYMBRACDAX0IZAh9CXQBoAOIBmQIGQChAWQIGQCJAnQBoAKIAnQBoASIBmQIGQChAaEC\nfQqQAnicdAV8BYMBRACQAl2OiQGIBYgBGQBkDmQGZAeFAmYCGQB9C4gFiAEZAGQOZAdkAoUCZgIZ\nAH0MdAaIBogBGQB8AXwGiAEZABkAfAJ8B2QPZBCNBVwEfQ19Dn0PfRB0AaAHfA98EGcCoQGJBIgF\niAEZAGQOZAJkCoUCZgIZAHwIiAEZAGQCZAJkEYUDGQAUAHwNGAB9EXQBoAiIBYgBGQBkDmQKZAaF\nAmYCGQB8AXwGiAEZABkAGwB8B2QCZAJkEYUDGQAUAKEBfRJ0AaAJfAt8EnQBoAp8EqEBoQN9EmQK\niAWIARkAZA5kCmQBhQJmAhkAiAWIARkAZA5kAWQGhQJmAhkAFAAYAH0TdAtqDHQBoASIBWQIGQCh\nAWQJZA9kEo0DfRR0AaACfAtkE6ECiQOHAIcBhwOHBIcFZgVkFGQVhAh9FXQLoA2HAmYBZBZkF4QI\nfBVkCHwUZwKhA1wCfRZ9FHwUoA6hAH0UdAGgD3wUZBGhAn0UfAt8ExQAdAFqEHwRfA5kDmQIZAqF\nAmYCGQBkD2QYjQMUAH0XfAt8ExQAZBkUAHQBoBF8EnwOZA5kCmQGhQJmAhkAGAChARQAfRh8C3QB\nahB8C3wOZA5kBmQHhQJmAhkAZA9kGI0DFABkCXwLGAB0AWoQfAt8DmQOZAZkB4UCZgIZAGQPZBiN\nAxQAfBQUABcAfRl8C3QBahB8DHwOZA5kB2QChQJmAhkAZA9kGI0DFAB9GnQBoBJ8F6EBfAobAH0X\ndAGgEnwYoQF8ChsAfRh0AaASfBmhAXwKGwB9GXQBoBJ8GqEBfAobAH0afAl8F3wYFwB8GRcAfBoX\nADcAfQl8BHLYdAtqE3wJfAl8F3wYfBl8GnQBoBJ8FKEBZwZkGmQbjQN9CXHYVwB8CVMAKRzhkAEA\nAFJldHVybiB5b2xvX2xvc3MgdGVuc29yCgogICAgUGFyYW1ldGVycwogICAgLS0tLS0tLS0tLQog\nICAgeW9sb19vdXRwdXRzOiBsaXN0IG9mIHRlbnNvciwgdGhlIG91dHB1dCBvZiB5b2xvX2JvZHkg\nb3IgdGlueV95b2xvX2JvZHkKICAgIHlfdHJ1ZTogbGlzdCBvZiBhcnJheSwgdGhlIG91dHB1dCBv\nZiBwcmVwcm9jZXNzX3RydWVfYm94ZXMKICAgIGFuY2hvcnM6IGFycmF5LCBzaGFwZT0oTiwgMiks\nIHdoCiAgICBudW1fY2xhc3NlczogaW50ZWdlcgogICAgaWdub3JlX3RocmVzaDogZmxvYXQsIHRo\nZSBpb3UgdGhyZXNob2xkIHdoZXRoZXIgdG8gaWdub3JlIG9iamVjdCBjb25maWRlbmNlIGxvc3MK\nCiAgICBSZXR1cm5zCiAgICAtLS0tLS0tCiAgICBsb3NzOiB0ZW5zb3IsIHNoYXBlPSgxLCkKCiAg\nICDpAwAAAE7pBgAAAOkHAAAA6QgAAADpBAAAAOkFAAAA6QAAAADpAQAAAOkCAAAA6SAAAABjAQAA\nAAAAAAACAAAACQAAABMAAABzNAAAAGcAfABdLH0BdACgAXQAoAKIAXwBGQChAWQAZAGFAhkAdACg\nA4gAZAIZAKEBoQKRAnEEUwApA3IJAAAAcgIAAAByCAAAACkE2gFL2gRjYXN02gVzaGFwZdoFZHR5\ncGUpAtoCLjDaAWwpAtoGeV90cnVl2gx5b2xvX291dHB1dHOpAPoePGlweXRob24taW5wdXQtNS00\nMzkwZjI2NGRhNTA++go8bGlzdGNvbXA+fgAAAHMCAAAABgB6HXlvbG9fbG9zcy48bG9jYWxzPi48\nbGlzdGNvbXA+LlQpAdoJY2FsY19sb3Nz6f////8pAtoEc2l6ZdoMZHluYW1pY19zaXpl2gRib29s\nYwIAAAAAAAAABQAAAAkAAAATAAAAc24AAAB0AKABiASIARkAfABkAWQCZAOFAmYDGQCIAnwAZAFk\nAmYDGQChAn0CdAKIA3wAGQB8AoMCfQN0A2oEfANkBGQFjQJ9BHwBoAV8AHQDoAZ8BIgAawB0A6AH\nfAKhAaECoQJ9AXwAZAYXAHwBZgJTACkHTi5yCAAAAHIGAAAAchgAAAApAdoEYXhpc3IJAAAAKQja\nAnRm2gxib29sZWFuX21hc2vaB2JveF9pb3VyDAAAANoDbWF42gV3cml0ZXINAAAAcg8AAAApBdoB\nYtoLaWdub3JlX21hc2taCHRydWVfYm942gNpb3VaCGJlc3RfaW91KQXaDWlnbm9yZV90aHJlc2hy\nEQAAANoQb2JqZWN0X21hc2tfYm9vbNoIcHJlZF9ib3hyEgAAAHIUAAAAchUAAADaCWxvb3BfYm9k\neZMAAABzCgAAAAABKAEOAQ4BHgF6HHlvbG9fbG9zcy48bG9jYWxzPi5sb29wX2JvZHljAQAAAAAA\nAAACAAAAAgAAABcAAABzCAAAAHwAiABrAFMAKQFOchQAAAApAnIiAAAA2gRhcmdzKQHaAW1yFAAA\nAHIVAAAA2gg8bGFtYmRhPpkAAADzAAAAAHobeW9sb19sb3NzLjxsb2NhbHM+LjxsYW1iZGE+KQHa\nC2Zyb21fbG9naXRzZwAAAAAAAOA/egZsb3NzOiApAdoHbWVzc2FnZSkU2gNsZW5yDAAAAHINAAAA\ncg4AAAByDwAAANoFcmFuZ2XaCXlvbG9faGVhZNoLY29uY2F0ZW5hdGXaA2xvZ9oGc3dpdGNo2gp6\nZXJvc19saWtlch0AAADaC1RlbnNvckFycmF52gp3aGlsZV9sb29w2gVzdGFja9oLZXhwYW5kX2Rp\nbXPaE2JpbmFyeV9jcm9zc2VudHJvcHnaBnNxdWFyZdoDc3Vt2gVQcmludCkbcikAAADaB2FuY2hv\ncnPaC251bV9jbGFzc2VzciUAAABaCnByaW50X2xvc3PaCm51bV9sYXllcnPaC2FuY2hvcl9tYXNr\n2gtpbnB1dF9zaGFwZdoLZ3JpZF9zaGFwZXPaBGxvc3PaAm1mWgtvYmplY3RfbWFza1oQdHJ1ZV9j\nbGFzc19wcm9ic9oEZ3JpZFoIcmF3X3ByZWRaB3ByZWRfeHlaB3ByZWRfd2haC3Jhd190cnVlX3h5\nWgtyYXdfdHJ1ZV93aFoOYm94X2xvc3Nfc2NhbGVyIwAAAHIoAAAA2gFfWgd4eV9sb3NzWgd3aF9s\nb3NzWg9jb25maWRlbmNlX2xvc3NaCmNsYXNzX2xvc3NyFAAAACkHciUAAAByEQAAAHIqAAAAciYA\nAAByJwAAAHISAAAAchMAAAByFQAAANoJeW9sb19sb3NzaQAAAHNKAAAAABAMAQwBDAE4ASwBGAEE\nARIBFgISARQBFAImAQ4DKgE0ARQBLAMaAQwBFAYeAQgBDAMkASYBHgEqASACDgEOAQ4BDgEUAQQB\nJgE=\n", [0.5, false], null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {"anchors": [[10.0, 14.0], [23.0, 27.0], [37.0, 58.0], [81.0, 82.0], [135.0, 169.0], [344.0, 319.0]], "num_classes": 80, "ignore_thresh": 0.7}}, "inbound_nodes": [[["model_0_outputLayer_0", 0, 0, {}], ["model_0_outputLayer_1", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}], "input_layers": [["model_0_inputLayer", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["yolo_loss_model_0", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}