{"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "model_3_inputLayer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "model_3_inputLayer"}, "inbound_nodes": []}, {"name": "Conv2D_model_3_layer0_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer0_branch", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["model_3_inputLayer", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer0_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer0_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer0_branch", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer0_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer0_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer0_branch", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer0_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer0_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer0_branch", 0, 0, {}]]]}, {"name": "leaky_re_lu_40", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_40", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer0_branch", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer0_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer0_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_40", 0, 0, {}]]]}, {"name": "max_pooling2d_19", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_19", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["ThirdRound_model_3_layer0_branch", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer1_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer1_branch", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_19", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer1_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer1_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer1_branch", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer1_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer1_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer1_branch", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer1_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer1_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer1_branch", 0, 0, {}]]]}, {"name": "leaky_re_lu_41", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_41", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer1_branch", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer1_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer1_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_41", 0, 0, {}]]]}, {"name": "max_pooling2d_20", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["ThirdRound_model_3_layer1_branch", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer2_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer2_branch", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_20", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer2_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer2_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer2_branch", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer2_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer2_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer2_branch", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer2_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer2_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer2_branch", 0, 0, {}]]]}, {"name": "leaky_re_lu_42", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_42", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer2_branch", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer2_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer2_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_42", 0, 0, {}]]]}, {"name": "max_pooling2d_21", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["ThirdRound_model_3_layer2_branch", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer3_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer3_branch", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_21", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer3_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer3_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer3_branch", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer3_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer3_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer3_branch", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer3_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer3_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer3_branch", 0, 0, {}]]]}, {"name": "leaky_re_lu_43", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_43", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer3_branch", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer3_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer3_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_43", 0, 0, {}]]]}, {"name": "max_pooling2d_22", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_22", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["ThirdRound_model_3_layer3_branch", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer4_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer4_branch", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_22", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer4_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer4_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer4_branch", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer4_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer4_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer4_branch", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer4_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer4_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer4_branch", 0, 0, {}]]]}, {"name": "leaky_re_lu_44", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_44", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer4_branch", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer4_branch", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer4_branch", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_44", 0, 0, {}]]]}, {"name": "max_pooling2d_23", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_23", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["ThirdRound_model_3_layer4_branch", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer5_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer5_branch0", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_23", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer5_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer5_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer5_branch0", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer5_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer5_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer5_branch0", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer5_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer5_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer5_branch0", 0, 0, {}]]]}, {"name": "leaky_re_lu_45", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_45", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer5_branch0", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer5_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer5_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_45", 0, 0, {}]]]}, {"name": "max_pooling2d_24", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_24", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["ThirdRound_model_3_layer5_branch0", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer6_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer6_branch0", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_24", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer6_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer6_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer6_branch0", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer6_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer6_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer6_branch0", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer6_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer6_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer6_branch0", 0, 0, {}]]]}, {"name": "leaky_re_lu_46", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_46", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer6_branch0", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer6_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer6_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_46", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer7_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer7_branch0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ThirdRound_model_3_layer6_branch0", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer7_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer7_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer7_branch0", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer7_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer7_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer7_branch0", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer7_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer7_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer7_branch0", 0, 0, {}]]]}, {"name": "leaky_re_lu_47", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_47", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer7_branch0", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer7_branch0", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer7_branch0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_47", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer8_branch00", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer8_branch00", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ThirdRound_model_3_layer7_branch0", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer8_branch00", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer8_branch00", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer8_branch00", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer8_branch00", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer8_branch00", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer8_branch00", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer8_branch00", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer8_branch00", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer8_branch00", 0, 0, {}]]]}, {"name": "leaky_re_lu_48", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_48", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer8_branch00", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer8_branch00", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer8_branch00", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_48", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["ThirdRound_model_3_layer8_branch00", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["ThirdRound_model_3_layer4_branch", 0, 0, {}], ["up_sampling2d_4", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer8_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer8_branch01", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ThirdRound_model_3_layer7_branch0", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer9_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer9_branch1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer8_branch01", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer8_branch01", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer8_branch01", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer9_branch1", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer9_branch1", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer9_branch1", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer8_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer8_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer8_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer9_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer9_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer9_branch1", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer8_branch01", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer8_branch01", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer8_branch01", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer9_branch1", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer9_branch1", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer9_branch1", 0, 0, {}]]]}, {"name": "leaky_re_lu_51", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_51", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer8_branch01", 0, 0, {}]]]}, {"name": "leaky_re_lu_49", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_49", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer9_branch1", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer8_branch01", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer8_branch01", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_51", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer9_branch1", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer9_branch1", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_49", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layer9_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layer9_branch01", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ThirdRound_model_3_layer8_branch01", 0, 0, {}]]]}, {"name": "Conv2D_model_3_layerA_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_3_layerA_branch1", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.0005000000237487257}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["ThirdRound_model_3_layer9_branch1", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layer9_branch01", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layer9_branch01", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layer9_branch01", 0, 0, {}]]]}, {"name": "FirstRound_model_3_layerA_branch1", "class_name": "RoundOverflowQ9_4", "config": {"name": "FirstRound_model_3_layerA_branch1", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["Conv2D_model_3_layerA_branch1", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layer9_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layer9_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layer9_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_3_layerA_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_3_layerA_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["FirstRound_model_3_layerA_branch1", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layer9_branch01", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layer9_branch01", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layer9_branch01", 0, 0, {}]]]}, {"name": "SecondRound_model_3_layerA_branch1", "class_name": "RoundOverflowQ9_4", "config": {"name": "SecondRound_model_3_layerA_branch1", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_3_layerA_branch1", 0, 0, {}]]]}, {"name": "leaky_re_lu_52", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_52", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layer9_branch01", 0, 0, {}]]]}, {"name": "leaky_re_lu_50", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_50", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["SecondRound_model_3_layerA_branch1", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layer9_branch01", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layer9_branch01", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_52", 0, 0, {}]]]}, {"name": "ThirdRound_model_3_layerA_branch1", "class_name": "RoundOverflowQ9_4", "config": {"name": "ThirdRound_model_3_layerA_branch1", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["leaky_re_lu_50", 0, 0, {}]]]}, {"name": "model_3_outputLayer_0", "class_name": "IdentityFinalLayer", "config": {"name": "model_3_outputLayer_0", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["ThirdRound_model_3_layer9_branch01", 0, 0, {}]]]}, {"name": "model_3_outputLayer_1", "class_name": "IdentityFinalLayer", "config": {"name": "model_3_outputLayer_1", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["ThirdRound_model_3_layerA_branch1", 0, 0, {}]]]}], "input_layers": [["model_3_inputLayer", 0, 0]], "output_layers": [["model_3_outputLayer_0", 0, 0], ["model_3_outputLayer_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}