{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "model_4_inputLayer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "model_4_inputLayer"}, "inbound_nodes": []}, {"name": "Conv2D_model_4_layer0_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer0_branch", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["model_4_inputLayer", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer0_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer0_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer0_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_1", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer0_branch", 0, 0, {}]], [["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_1", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer1_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer1_branch", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer1_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer1_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer1_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_2", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer1_branch", 0, 0, {}]], [["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_2", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer2_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer2_branch", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer2_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer2_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer2_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_3", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer2_branch", 0, 0, {}]], [["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_3", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer3_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer3_branch", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer3_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer3_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer3_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_4", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer3_branch", 0, 0, {}]], [["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_4", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer4_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer4_branch", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer4_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer4_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer4_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_5", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer4_branch", 0, 0, {}]], [["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_5", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_5", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer5_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer5_branch0", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer5_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer5_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer5_branch0", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_6", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer5_branch0", 0, 0, {}]], [["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_6", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_6", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer6_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer6_branch0", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer6_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer6_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer6_branch0", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_7", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer6_branch0", 0, 0, {}]], [["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_7", 0, 0, {}]]]}, {"name": "Conv2D_model_4_layer7_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer7_branch0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_7", 1, 0, {}]]]}, {"name": "BatchNorm_model_4_layer7_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer7_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer7_branch0", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_8", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer7_branch0", 0, 0, {}]], [["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_8", 0, 0, {}]]]}, {"name": "Conv2D_model_4_layer8_branch00", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer8_branch00", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_8", 1, 0, {}]]]}, {"name": "BatchNorm_model_4_layer8_branch00", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer8_branch00", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer8_branch00", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_9", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer8_branch00", 0, 0, {}]], [["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_9", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["round_overflow_q3_4_9", 1, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["round_overflow_q3_4_5", 1, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"name": "Conv2D_model_4_layer8_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer8_branch01", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_8", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer9_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer9_branch1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer8_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer8_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer8_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer9_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer9_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer9_branch1", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_12", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer8_branch01", 0, 0, {}]], [["leaky_re_lu_12", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_10", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer9_branch1", 0, 0, {}]], [["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_12", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_10", 0, 0, {}]]]}, {"name": "Conv2D_model_4_layer9_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer9_branch01", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_12", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layerA_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layerA_branch1", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_10", 1, 0, {}]]]}, {"name": "BatchNorm_model_4_layer9_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer9_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer9_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layerA_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layerA_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layerA_branch1", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_13", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer9_branch01", 0, 0, {}]], [["leaky_re_lu_13", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_11", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layerA_branch1", 0, 0, {}]], [["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_13", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_13", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_11", 0, 0, {}]]]}, {"name": "model_4_outputLayer_0", "class_name": "IdentityFinalLayer", "config": {"name": "IdentityFinalLayer", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["round_overflow_q3_4_13", 1, 0, {}]]]}, {"name": "model_4_outputLayer_1", "class_name": "IdentityFinalLayer", "config": {"name": "IdentityFinalLayer", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["round_overflow_q3_4_11", 1, 0, {}]]]}], "input_layers": [["model_4_inputLayer", 0, 0]], "output_layers": [["model_4_outputLayer_0", 0, 0], ["model_4_outputLayer_1", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}