{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "model_4_inputLayer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "model_4_inputLayer"}, "inbound_nodes": []}, {"name": "Conv2D_model_4_layer0_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer0_branch", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["model_4_inputLayer", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer0_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer0_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer0_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_1", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer0_branch", 0, 0, {}]], [["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_1", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer1_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer1_branch", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer1_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer1_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer1_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_2", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer1_branch", 0, 0, {}]], [["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_2", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_2", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer2_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer2_branch", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer2_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer2_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer2_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_3", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer2_branch", 0, 0, {}]], [["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_3", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_3", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer3_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer3_branch", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer3_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer3_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer3_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_4", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer3_branch", 0, 0, {}]], [["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_4", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_4", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer4_branch", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer4_branch", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer4_branch", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer4_branch", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer4_branch", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_5", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer4_branch", 0, 0, {}]], [["leaky_re_lu_5", 0, 0, {}]]]}, {"name": "leaky_re_lu_5", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_5", 0, 0, {}]]]}, {"name": "max_pooling2d_5", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_5", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_5", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer5_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer5_branch0", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer5_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer5_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer5_branch0", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_6", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer5_branch0", 0, 0, {}]], [["leaky_re_lu_6", 0, 0, {}]]]}, {"name": "leaky_re_lu_6", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_6", 0, 0, {}]]]}, {"name": "max_pooling2d_6", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_6", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "same", "strides": [1, 1], "data_format": "channels_last"}, "inbound_nodes": [[["round_overflow_q3_4_6", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer6_branch0", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer6_branch0", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer6_branch0", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer6_branch0", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer6_branch0", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_7", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer6_branch0", 0, 0, {}]], [["leaky_re_lu_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_7", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_7", 0, 0, {}]]]}, {"name": "Conv2D_", "class_name": "Conv2D", "config": {"name": "Conv2D_", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_7", 1, 0, {}]]]}, {"name": "BatchNorm_", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_8", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_", 0, 0, {}]], [["leaky_re_lu_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_8", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_8", 0, 0, {}]]]}, {"name": "Conv2D_model_4_layer7_branch00", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer7_branch00", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_8", 1, 0, {}]]]}, {"name": "BatchNorm_model_4_layer7_branch00", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer7_branch00", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer7_branch00", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_9", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer7_branch00", 0, 0, {}]], [["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_9", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["round_overflow_q3_4_9", 1, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["round_overflow_q3_4_5", 1, 0, {}], ["up_sampling2d_1", 0, 0, {}]]]}, {"name": "Conv2D_model_4_layer7_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer7_branch01", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_8", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer8_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer8_branch1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer7_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer7_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer7_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer8_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer8_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer8_branch1", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_12", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer7_branch01", 0, 0, {}]], [["leaky_re_lu_12", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_10", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer8_branch1", 0, 0, {}]], [["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_12", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_10", 0, 0, {}]]]}, {"name": "Conv2D_model_4_layer8_branch01", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer8_branch01", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_12", 1, 0, {}]]]}, {"name": "Conv2D_model_4_layer9_branch1", "class_name": "Conv2D", "config": {"name": "Conv2D_model_4_layer9_branch1", "trainable": true, "dtype": "float32", "filters": 255, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["round_overflow_q3_4_10", 1, 0, {}]]]}, {"name": "BatchNorm_model_4_layer8_branch01", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer8_branch01", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer8_branch01", 0, 0, {}]]]}, {"name": "BatchNorm_model_4_layer9_branch1", "class_name": "BatchNormalization", "config": {"name": "BatchNorm_model_4_layer9_branch1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Conv2D_model_4_layer9_branch1", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_13", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer8_branch01", 0, 0, {}]], [["leaky_re_lu_13", 0, 0, {}]]]}, {"name": "round_overflow_q3_4_11", "class_name": "RoundOverflowQ3_4", "config": {"name": "RoundOverflowQ3_4", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["BatchNorm_model_4_layer9_branch1", 0, 0, {}]], [["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "leaky_re_lu_13", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_13", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.10000000149011612}, "inbound_nodes": [[["round_overflow_q3_4_11", 0, 0, {}]]]}, {"name": "model_4_outputLayer_0", "class_name": "IdentityFinalLayer", "config": {"name": "IdentityFinalLayer", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["round_overflow_q3_4_13", 1, 0, {}]]]}, {"name": "model_4_outputLayer_1", "class_name": "IdentityFinalLayer", "config": {"name": "IdentityFinalLayer", "trainable": false, "dtype": "float32"}, "inbound_nodes": [[["round_overflow_q3_4_11", 1, 0, {}]]]}, {"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 13, 13, 3, 85], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 26, 3, 85], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "yolo_loss_model_4", "class_name": "Lambda", "config": {"name": "yolo_loss_model_4", "trainable": true, "dtype": "float32", "function": ["4wUAAAAAAAAAGwAAAAkAAAADAAAAc0oDAAB0AHwBgwFkARoAfQV8AGQCfAWFAhkAiQZ8AHwFZAKF\nAhkAiQV8BWQBawJySGQDZARkBWcDZAFkBmQHZwNkCGQJZApnA2cDbhJkAWQGZAdnA2QJZApkAWcD\nZwJ9BnQBoAJ0AaADiAZkCBkAoQFkCWQBhQIZAGQLFAB0AaAEiAVkCBkAoQGhAn0HhwWHBmYCZAxk\nDYQIdAV8BYMBRACDAX0IZAh9CXQBoAOIBmQIGQChAWQIGQCJAnQBoAKIAnQBoASIBmQIGQChAaEC\nfQqQAnh2dAV8BYMBRACQAl1oiQGIBYgBGQBkDmQGZAeFAmYCGQB9C4gFiAEZAGQOZAdkAoUCZgIZ\nAH0MdAaIBogBGQB8AXwGiAEZABkAfAJ8B2QPZBCNBVwEfQ19Dn0PfRB0AaAHfA98EGcCoQGJBIgF\niAEZAGQOZAJkCoUCZgIZAHwIiAEZAGQCZAJkEYUDGQAUAHwNGAB9EXQBoAiIBYgBGQBkDmQKZAaF\nAmYCGQB8AXwGiAEZABkAGwB8B2QCZAJkEYUDGQAUAKEBfRJ0AaAJfAt8EnQBoAp8EqEBoQN9EmQK\niAWIARkAZA5kCmQBhQJmAhkAiAWIARkAZA5kAWQGhQJmAhkAFAAYAH0TdAtqDHQBoASIBWQIGQCh\nAWQJZA9kEo0DfRR0AaACfAtkE6ECiQOHAIcBhwOHBIcFZgVkFGQVhAh9FXQLoA2HAmYBZBZkF4QI\nfBVkCHwUZwKhA1wCfRZ9FHwUoA6hAH0UdAGgD3wUZBGhAn0UfAt8ExQAdAFqEHwRfA5kDmQIZAqF\nAmYCGQBkD2QYjQMUAH0XfAt8ExQAZBkUAHQBoBF8EnwOZA5kCmQGhQJmAhkAGAChARQAfRh8C3QB\nahB8C3wOZA5kBmQHhQJmAhkAZA9kGI0DFABkCXwLGAB0AWoQfAt8DmQOZAZkB4UCZgIZAGQPZBiN\nAxQAfBQUABcAfRl8C3QBahB8DHwOZA5kB2QChQJmAhkAZA9kGI0DFAB9GnQBoBJ8F6EBfAobAH0X\ndAGgEnwYoQF8ChsAfRh0AaASfBmhAXwKGwB9GXQBoBJ8GqEBfAobAH0afAl8F3wYFwB8GRcAfBoX\nADcAfQlx2FcAfAlTACka4ZABAABSZXR1cm4geW9sb19sb3NzIHRlbnNvcgoKICAgIFBhcmFtZXRl\ncnMKICAgIC0tLS0tLS0tLS0KICAgIHlvbG9fb3V0cHV0czogbGlzdCBvZiB0ZW5zb3IsIHRoZSBv\ndXRwdXQgb2YgeW9sb19ib2R5IG9yIHRpbnlfeW9sb19ib2R5CiAgICB5X3RydWU6IGxpc3Qgb2Yg\nYXJyYXksIHRoZSBvdXRwdXQgb2YgcHJlcHJvY2Vzc190cnVlX2JveGVzCiAgICBhbmNob3JzOiBh\ncnJheSwgc2hhcGU9KE4sIDIpLCB3aAogICAgbnVtX2NsYXNzZXM6IGludGVnZXIKICAgIGlnbm9y\nZV90aHJlc2g6IGZsb2F0LCB0aGUgaW91IHRocmVzaG9sZCB3aGV0aGVyIHRvIGlnbm9yZSBvYmpl\nY3QgY29uZmlkZW5jZSBsb3NzCgogICAgUmV0dXJucwogICAgLS0tLS0tLQogICAgbG9zczogdGVu\nc29yLCBzaGFwZT0oMSwpCgogICAg6QMAAABO6QYAAADpBwAAAOkIAAAA6QQAAADpBQAAAOkAAAAA\n6QEAAADpAgAAAOkgAAAAYwEAAAAAAAAAAgAAAAkAAAATAAAAczQAAABnAHwAXSx9AXQAoAF0AKAC\niAF8ARkAoQFkAGQBhQIZAHQAoAOIAGQCGQChAaECkQJxBFMAKQNyCQAAAHICAAAAcggAAAApBNoB\nS9oEY2FzdNoFc2hhcGXaBWR0eXBlKQLaAi4w2gFsKQLaBnlfdHJ1ZdoMeW9sb19vdXRwdXRzqQD6\nHjxpcHl0aG9uLWlucHV0LTUtMmM2ZDk5NTU5NjY4PvoKPGxpc3Rjb21wPn4AAABzAgAAAAYAeh15\nb2xvX2xvc3MuPGxvY2Fscz4uPGxpc3Rjb21wPi5UKQHaCWNhbGNfbG9zc+n/////KQLaBHNpemXa\nDGR5bmFtaWNfc2l6ZdoEYm9vbGMCAAAAAAAAAAUAAAAJAAAAEwAAAHNuAAAAdACgAYgEiAEZAHwA\nZAFkAmQDhQJmAxkAiAJ8AGQBZAJmAxkAoQJ9AnQCiAN8ABkAfAKDAn0DdANqBHwDZARkBY0CfQR8\nAaAFfAB0A6AGfASIAGsAdAOgB3wCoQGhAqECfQF8AGQGFwB8AWYCUwApB04ucggAAAByBgAAAHIY\nAAAAKQHaBGF4aXNyCQAAACkI2gJ0ZtoMYm9vbGVhbl9tYXNr2gdib3hfaW91cgwAAADaA21heNoF\nd3JpdGVyDQAAAHIPAAAAKQXaAWLaC2lnbm9yZV9tYXNrWgh0cnVlX2JveNoDaW91WghiZXN0X2lv\ndSkF2g1pZ25vcmVfdGhyZXNochEAAADaEG9iamVjdF9tYXNrX2Jvb2zaCHByZWRfYm94chIAAABy\nFAAAAHIVAAAA2glsb29wX2JvZHmTAAAAcwoAAAAAASgBDgEOAR4Behx5b2xvX2xvc3MuPGxvY2Fs\ncz4ubG9vcF9ib2R5YwEAAAAAAAAAAgAAAAIAAAAXAAAAcwgAAAB8AIgAawBTACkBTnIUAAAAKQJy\nIgAAANoEYXJncykB2gFtchQAAAByFQAAANoIPGxhbWJkYT6ZAAAA8wAAAAB6G3lvbG9fbG9zcy48\nbG9jYWxzPi48bGFtYmRhPikB2gtmcm9tX2xvZ2l0c2cAAAAAAADgPykT2gNsZW5yDAAAAHINAAAA\ncg4AAAByDwAAANoFcmFuZ2XaCXlvbG9faGVhZNoLY29uY2F0ZW5hdGXaA2xvZ9oGc3dpdGNo2gp6\nZXJvc19saWtlch0AAADaC1RlbnNvckFycmF52gp3aGlsZV9sb29w2gVzdGFja9oLZXhwYW5kX2Rp\nbXPaE2JpbmFyeV9jcm9zc2VudHJvcHnaBnNxdWFyZdoDc3VtKRtyKQAAANoHYW5jaG9yc9oLbnVt\nX2NsYXNzZXNyJQAAAFoKcHJpbnRfbG9zc9oKbnVtX2xheWVyc9oLYW5jaG9yX21hc2vaC2lucHV0\nX3NoYXBl2gtncmlkX3NoYXBlc9oEbG9zc9oCbWZaC29iamVjdF9tYXNrWhB0cnVlX2NsYXNzX3By\nb2Jz2gRncmlkWghyYXdfcHJlZFoHcHJlZF94eVoHcHJlZF93aFoLcmF3X3RydWVfeHlaC3Jhd190\ncnVlX3doWg5ib3hfbG9zc19zY2FsZXIjAAAAcigAAADaAV9aB3h5X2xvc3NaB3doX2xvc3NaD2Nv\nbmZpZGVuY2VfbG9zc1oKY2xhc3NfbG9zc3IUAAAAKQdyJQAAAHIRAAAAcioAAAByJgAAAHInAAAA\nchIAAAByEwAAAHIVAAAA2gl5b2xvX2xvc3NpAAAAc0YAAAAAEAwBDAEMATgBLAEYAQQBEgEWAhIB\nFAEUAiYBDgMqATQBFAEsAxoBDAEUBh4BCAEMAyQBJgEeASoBIAIOAQ4BDgEOARgB\n", [0.5, false], null], "function_type": "lambda", "output_shape": [1], "output_shape_type": "raw", "arguments": {"anchors": [[10.0, 14.0], [23.0, 27.0], [37.0, 58.0], [81.0, 82.0], [135.0, 169.0], [344.0, 319.0]], "num_classes": 80, "ignore_thresh": 0.7}}, "inbound_nodes": [[["model_4_outputLayer_0", 0, 0, {}], ["model_4_outputLayer_1", 0, 0, {}], ["input_1", 0, 0, {}], ["input_2", 0, 0, {}]]]}], "input_layers": [["model_4_inputLayer", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["yolo_loss_model_4", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}